using System;
using System.Collections.Generic;
using System.ComponentModel;
using System.Data;
using System.Drawing;
using System.Linq;
using System.Text;
using System.Windows.Forms;

namespace Table
{
    public partial class Info : Form
    {
        public Info()
        {
            InitializeComponent();
            Show();
        }

        private void Show()
        {
            richTextBox1.Text = "Інструкція\n" +
                "Програма E-Table призначена для створення і редагування електронних таблиць." +
                "Містить вбудований парсер рядків, що перетворює рядкове значення у формулу, а також рахує її значення." +
                "Для того, щоб задати формулу, оберіть ячейку і задайте формулу у відповідному текстовому полі (формат: =[формула]\n" +
                "Синтаксис:\n" +
                "$[ім'я колонки][номер рядка] - посилання на ячейку;\n" +
                "[значення] - число або посилання \n" +
                "(+[значення]) - унарний + (модуль)\n" +
                "(-[значення]) - унарний -\n" +
                "[значення]+[значення] - арифметичне додавання\n" +
                "[значення]-[значення] - арифметична різниця\n" +
                "[значення]*[значення] - арифметичне множення\n" +                "[значення]/[значення] - арифметичне ділення\n" +
                "div([значення]|[значення]) - ділення без остачі\n" +
                "mod([значення]|[значення]) - остача від ділення\n" +
                "max([значення]|[значення]) - максимальне значення\n" +
                "min([значення]|[значення]) - мінімальне значення\n" +
                "Також підтримується відокремлення виразів дужками задля побудови складніших виразів. \n" +
                "Створену таблицю можна збегірти у форматі HTML, змінити її розмір, відкрити вже існуючу таблицю або останню таблицю," +
                " з якою працювали під час минулого сеансу роботи з програмою. Кожна з опцій доступна у меню 'Операції'\n" +
                "Для перевірки правильності роботи програми доцільно скористатися Unit - тестами\n";
        }

        private void richTextBox1_TextChanged(object sender, EventArgs e)
        {

        }
    }
}
